tutorials/interBRNSALEFoam/channelBiofilm/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2212                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Simple 2D channel: 10mm x 5mm x 0.1mm (quasi-2D)
// Water in bottom 3mm, air in top 2mm
// Bottom wall has biofilm growth patch

scale   1e-3;  // mm to m

vertices
(
    (0 0 0)      // 0
    (10 0 0)     // 1
    (10 5 0)     // 2
    (0 5 0)      // 3
    (0 0 0.1)    // 4
    (10 0 0.1)   // 5
    (10 5 0.1)   // 6
    (0 5 0.1)    // 7
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (50 25 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 4 7 3)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (1 2 6 5)
        );
    }
    top
    {
        type patch;
        faces
        (
            (3 7 6 2)
        );
    }
    biofilmWall
    {
        type wall;
        faces
        (
            (0 1 5 4)
        );
    }
    frontAndBack
    {
        type empty;
        faces
        (
            (0 3 2 1)
            (4 5 6 7)
        );
    }
);

// ************************************************************************* //
